// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

//  let time = +prompt('Введіть число:')
//
//  if (time >= 0 && time <= 15) {
//   alert('Перша четверть')
//  }
// if (time > 15 && time <= 30) {
//  alert('Друга четверть')
// }
// if (time > 30 && time <= 45) {
//  alert('Третя четверть')
// }
// if (time > 45 && time <= 59) {
//  alert('Четверта четверть')
// }


// - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

//  let day = +prompt('Вкажіть число')
//
//  if(day >= 1 && day <= 10) {
//   alert('Перша декада')
//  }
//  if(day > 10 && day <= 20) {
//  alert('Друга декада')
// }
//  if(day > 20 && day <= 31) {
//  alert('Третя декада')
//  }

// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false.
//     Напишіть два варіанти скрипта - з коротким записом(тернаркою)

//  let test = confirm('') ? alert('Неправильно') : alert('Вірно');

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3

   // let a = +prompt('Введіть число')
   // if(a === 0) {
   //  alert('Невірно')
   // } else if (a !== 0) {
   //  alert('Вірно')
   // }

// - Скласти розклад на тиждень за домопоги switch.
//  Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt('Вкажіть день')
//  switch(day) {
//   case 1:
//   alert('Понеділок: Прокинутись')
//          break;
//   case 2:
//    alert('Вівторок: 1.Прокинутись швидше')
//          break;
//   case 3:
//    alert('Середа: 1.Лежати до 13:00')
//          break;
//   case 4:
//    alert('Четвер: 1.Лежати до 16:00')
//          break;
//   case 5:
//    alert('Пятниця: 1.Лежати до 18:00')
//          break;
//   case 6:
//    alert('Субота:1.Лежати до 20:00')
//          break;
//   case 7:
//    alert('Неділя: 1.Спати до понеділка')
//          break;
//   default: alert('Ви вказали не правильний день тижня!')
//  }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = (+prompt('Скільки днів?') / 4)
//
// if (year === 91.5) {
//   alert('Високосний рік')
// } else if(year === 91.25) {
//  alert('Не Високосний рік')
// } else {
//  alert('Ви вказали не правильну кількість днів')
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

 // let name = prompt('Яка «офіційна» назва JavaScript?')
 // if(name === 'ECMAScript') {
 //  alert('Правильно!')
 // } else {
 //  alert('Не знаєте? ECMAScript!')
 // }
























